Autodesk.Revit.DB.ImageInstance.IsValidView(Autodesk.Revit.DB.View)
Check that the view is a valid view for ImageInstance elements
view:
The view to validate
Returns:
True if the view can contain ImageInstance elements.  False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ImageInstance.SetLocation(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoxPlacement)
Moves the ImageInstance to the specified location
newLocation:
The new location of the specified point
placementPoint:
The placementPoint specifies which point of the ImageInstance should be placed at the given location.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given newLocation is more than 10 miles from the origin of the model
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImageInstance.GetLocation(Autodesk.Revit.DB.BoxPlacement)
Returns the location of one of the points of the ImageInstance
placementPoint:
The placementPoint specifies for which point of the ImageInstance the location should be returned.
Returns:
The location of the specified point
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImageInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ImagePlacementOptions)
Creates a new ImageInstance element placed in a view.
document:
The document.
view:
The view in which the image will be placed.
imageTypeId:
The id of the Autodesk.Revit.DB.ImageType element for this ImageInstance.
placementOptions:
Options that specify where the ImageInstance should be placed.
Returns:
The new ImageInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given view cannot contain ImageInstance elements
-or-
The given imageTypeId can not be used as a ImageType for ImageInstance elements
-or-
The given placementOptions specify a location that is more than 10 miles from the origin of the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020

Autodesk.Revit.DB.ImageInstance.CanHaveSnaps
When true the ImageInstance has snaps that can be enabled with the Autodesk.Revit.DB.ImageInstance.EnableSnaps property
Remarks:
Snaps are only available for images based on PDF files that are vector based.
Since:
2020

Autodesk.Revit.DB.ImageInstance.EnableSnaps
When true the ImageInstance will have its snaps enabled, but only if Autodesk.Revit.DB.ImageInstance.CanHaveSnaps is true
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The image does not have snaps
Since:
2020

Autodesk.Revit.DB.ImageInstance.DrawLayer
The layer the ImageInstance will be drawn in.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImageInstance.LockProportions
When true the proportion of Autodesk.Revit.DB.ImageInstance.Width to Autodesk.Revit.DB.ImageInstance.Height will be maintained
Since:
2020

Autodesk.Revit.DB.ImageInstance.HeightScale
The factor applied to the Autodesk.Revit.DB.ImageType to calculate the Autodesk.Revit.DB.ImageInstance.Height of the ImageInstance.
Remarks:
If Autodesk.Revit.DB.ImageInstance.LockProportions is true, then changes to the Autodesk.Revit.DB.ImageInstance.HeightScale will also result in changes to the Autodesk.Revit.DB.ImageInstance.WidthScale.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for heightScale results in a height that is more than 30000 feet.
-or-
When setting this property: The given value for heightScale results in a width that is more than 30000 feet because LockProportions is set to true.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for heightScale must be non-negative.
Since:
2020

Autodesk.Revit.DB.ImageInstance.WidthScale
The factor applied to the width of the Autodesk.Revit.DB.ImageType to calculate the Autodesk.Revit.DB.ImageInstance.Width of the ImageInstance.
Remarks:
If Autodesk.Revit.DB.ImageInstance.LockProportions is true, then changes to the Autodesk.Revit.DB.ImageInstance.WidthScale will also result in changes to the Autodesk.Revit.DB.ImageInstance.HeightScale.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for widthScale results in a width that is more than 30000 feet.
-or-
When setting this property: The given value for widthScale results in a height that is more than 30000 feet because LockProportions is set to true.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for widthScale must be non-negative.
Since:
2020

Autodesk.Revit.DB.ImageInstance.Height
The height of the ImageInstance.
Remarks:
If Autodesk.Revit.DB.ImageInstance.LockProportions is true, then changes to the Autodesk.Revit.DB.ImageInstance.Height will also result in changes to the Autodesk.Revit.DB.ImageInstance.Width.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for height results in a width that is more than 30000 feet because LockProportions is set to true.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for height must be between 0 and 30000 feet.
Since:
2020

Autodesk.Revit.DB.ImageInstance.Width
The width of the ImageInstance.
Remarks:
If Autodesk.Revit.DB.ImageInstance.LockProportions is true, then changes to the Autodesk.Revit.DB.ImageInstance.Width will also result in changes to the Autodesk.Revit.DB.ImageInstance.Height.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for width results in a height that is more than 30000 feet because LockProportions is set to true.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for width must be between 0 and 30000 feet.
Since:
2020

Autodesk.Revit.DB.ImageInstance
An element that represents an instance of an image placed in a view
Since:
2020